/* ************************************************************************* */
/*  魚耕システム                                                             */
/*  モデル　ミックスイン                                                     */
/* ************************************************************************* */

(function($, $R){
  // 名前空間を設定する
  var App = $R.Library;

  // 関数を追加する
  App.Uoko01ViewMixin = {
    // -------------------------------------------------------------------
    //  ヘッダー日付を表示する
    // -------------------------------------------------------------------
    showヘッダー日付: function(arg) {
      $R.log("View showヘッダー日付 : start");
			
			var today = arg["ヘッダー日付"];
			$("#ヘッダー日付").val(today);
			
	    $R.log("View showヘッダー日付 : end");
    }
    // -------------------------------------------------------------------
    //  ヘッダー曜日を表示する
    // -------------------------------------------------------------------
   ,showヘッダー曜日: function(arg) {
      $R.log("View showヘッダー曜日 : start");
			
			var wday  = arg["ヘッダー曜日"];
			$("#ヘッダー曜日").text(wday);
			
	    $R.log("View showヘッダー曜日 : end");
    }

  };
}(jQuery, Rmenu));
